flowAroundSTL/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu SED_NU;

transportModel Newtonian;

nu nu [ 0 2 -1 0 0 0 0 ] $nu;

CrossPowerLawCoeffs
{
	nu0   nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
	nuInf nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
	m     m [ 0 0 1 0 0 0 0 ] 1;
	n     n [ 0 0 0 0 0 0 0 ] 1;
}

BirdCarreauCoeffs
{
	nu0   nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
	nuInf nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
	k     k [ 0 0 1 0 0 0 0 ] 0;
	n     n [ 0 0 0 0 0 0 0 ] 1;
}

// ************************************************************************* //
