flowAroundSTL/0/s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	location    "0";
	object      s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	walls
	{
		type zeroGradient;
	}

	inlet
	{
		type  fixedValue;
		value uniform 1;
	}
	
	outlet
	{
		type       inletOutlet;
		inletValue uniform 0;
		value      uniform 0;
	}
	
	SED_MODEL_NAME
	{
		type zeroGradient;
	}
	
	frontAndBack
	{
		type empty;
	}
}

// ************************************************************************* //
