flowAroundSTL/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system";
	object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//	default Euler;
	default CrankNicolson 0.5;
}

gradSchemes
{
	default Gauss linear;
	grad(p)	Gauss linear;
	grad(U) Gauss linear;
}

divSchemes
{    
	default          none;
	div(phi,U)       Gauss limitedLinearV 1;
	div(phi,k)       Gauss limitedLinear 1;
	div(phi,epsilon) Gauss limitedLinear 1;
	div(phi,R)       Gauss limitedLinear 1;
	div(R)           Gauss linear;
	div(phi,nuTilda) Gauss limitedLinear 1;
	div((nuEff*dev2(T(grad(U))))) Gauss linear;  // OF-5.0
}

laplacianSchemes
{    
	default none;
	laplacian(nuEff,U)             Gauss linear corrected;
	laplacian((1|A(U)),p)          Gauss linear corrected;
	laplacian(DkEff,k)             Gauss linear corrected;
	laplacian(DepsilonEff,epsilon) Gauss linear corrected;
	laplacian(DREff,R)             Gauss linear corrected;
	laplacian(DnuTildaEff,nuTilda) Gauss linear corrected;
	//	default	Gauss linear orthogonal;
}

interpolationSchemes
{
	default	linear;
	interpolate(U) linear;
}

snGradSchemes
{
	//default	orthogonal;
	default corrected;
}

fluxRequired
{
	default no;
	p;
}

// ************************************************************************* //
